Repository: wangchong2023/ZhiYu
Catalog: Sources/Localization/Catalogs/AI.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# prompt.default.quiz
source: Generate a quiz with 3 MCQs about the content. Output in JSON format: {"title":"...","questions":[{"id":0,"text":"...","options":["A","B","C","D"],"answer":0,"explanation":"..."}]}. answer is 0-based (0=A,1=B,2=C,3=D).
zh_hans: 基于内容生成知识测验，输出JSON格式：{"title":"标题","questions":[{"id":0,"text":"问题","options":["选项A","选项B","选项C","选项D"],"answer":0,"explanation":"解释"}]}。answer为0起始索引（0=A,1=B,2=C,3=D）。3道选择题。
zh_hant: 基於內容生成知識测驗，輸出JSON格式：{"title":"標題","questions":[{"id":0,"text":"問題","options":["選項A","選項B","選項C","選項D"],"answer":0,"explanation":"解釋"}]}。answer為0起始索引（0=A,1=B,2=C,3=D）。3道選擇題。

# prompt.default.report
source: 请基于以下内容生成一份深度的分析报告。包含：核心摘要、现状分析、挑战与对策、结论建议。 Keep the report within 1000 characters, be concise and to the point.
zh_hans: 请基于以下内容生成一份深度的分析报告。包含：核心摘要、现状分析、挑战与对策、结论建议。 报告请控制在 1000 字以内，简明扼要。
zh_hant: 請基於以下內容生成一份深度的分析报告。包含：核心摘要、現狀分析、挑戰与對策、結論建議。 报告請控制在 1000 字以內，简明扼要。

# prompt.default.slides
source: # Role: Professional Presentation Coach # Task: Transform content into a presentation outline with citations. # Requirements: 1. Use Markdown separator `---` for page breaks. 2. Each page contains a title and 3-5 key points. 3. **MUST include citations**: Mark each point with `[[Source]]`.
zh_hans: # Role: 专业演讲教练 # Task: 将内容转化为带引用的演示文稿大纲（幻灯片格式）。 # Requirements: 1. 使用 Markdown 分隔符 `---` 表示换页。 2. 每页包含标题和 3-5 个核心要点。 3. **必须标注来源**：每个要点后使用 `[[Source]]` 标记。
zh_hant: # Role: 專業演讲教练 # Task: 將內容轉化為带引用的演示文稿大纲（幻灯片格式）。 # Requirements: 1. 使用 Markdown 分隔符 `---` 表示換頁。 2. 每頁包含標題和 3-5 個核心要点。 3. **必须標注來源**：每個要点後使用 `[[Source]]` 標記。

# prompt.default.summary
source: Smart Summary
zh_hans: 智能总结
zh_hant: 智能總結

# prompt.expert.mindmap.footer
source: Impact: Control graph depth, node density, and visual style.
zh_hans: 影响：控制图谱的层级深度、节点密度和展示风格。
zh_hant: 影響：控制圖譜的层级深度、節点密度和展示風格。

# prompt.expert.mindmap.title
source: Mindmap
zh_hans: 思维导图
zh_hant: 思維导圖

# prompt.expert.quiz.footer
source: Impact: Control difficulty level, question distribution, and explanation detail.
zh_hans: 影响：控制题目的难易程度、题型分布及解析详略。
zh_hant: 影響：控制題目的难易程度、題型分布及解析詳略。

# prompt.expert.quiz.title
source: Knowledge Quiz
zh_hans: 知识测验
zh_hant: 知識测驗

# prompt.expert.report.footer
source: Impact: Control professional tone, analytical models, and citation precision.
zh_hans: 影响：控制报告的专业口吻、分析模型和引用精度。
zh_hant: 影響：控制报告的專業口吻、分析模型和引用精度。

# prompt.expert.report.title
source: Deep Report
zh_hans: 深度报告
zh_hant: 深度报告

# prompt.expert.slides.footer
source: Impact: Control point density and logical structure per slide.
zh_hans: 影响：控制每页幻灯片的要点密度和逻辑结构。
zh_hant: 影響：控制每頁幻灯片的要点密度和逻辑結構。

# prompt.expert.slides.title
source: Presentation
zh_hans: 演示文稿
zh_hant: 演示文稿

# prompt.factory.title
source: Prompt Settings
zh_hans: 提示词设置
zh_hant: 提示词設定

# prompt.predictQuestionsSystem
source: You are an assistant that predicts the next follow-up questions. Always output strictly in JSON string array format.
zh_hans: 你是一个预测用户后续问题的助手，必须且只能以 JSON 字符串数组格式输出结果。
zh_hant: 你是一個預测使用者後續問題的助手，必须且隻能以 JSON 字符串數組格式輸出結果。

# prompt.queryRewrite.footer
source: Search Collection:
zh_hans: 检索集合：
zh_hant: 检索集合：

# prompt.queryRewrite.instruction
source: You are a knowledge retrieval expert. Please analyze the following 'User Original Query' and rewrite it into a set of professional 'Structured Retrieval Terms'.
zh_hans: 你是一位知识检索专家。请分析以下“用户原始查询”，并将其改写为一组更专业的“结构化检索词”。
zh_hant: 你是一位知識检索專家。請分析以下“使用者原始查詢”，並將其改寫為一組更專業的“結構化检索词”。

# prompt.queryRewrite.rule1
source: Identify core concepts, entities, and technical terms in the query.
zh_hans: 识别查询中的核心概念、实体和技术术语。
zh_hant: 識別查詢中的核心概念、實體和技術術語。

# prompt.queryRewrite.rule2
source: Expand abbreviations (e.g., 'AI' to 'Artificial Intelligence').
zh_hans: 补全缩写（如“AI”改为“人工智能”）。
zh_hant: 補全縮寫（如“AI”改為“人工智能”）。

# prompt.queryRewrite.rule3
source: Expand related synonyms or domain-specific terms.
zh_hans: 扩展相关的近义词或相关领域词。
zh_hant: 擴展相關的近义词或相關領域词。

# prompt.queryRewrite.rule4
source: Directly output the rewritten search string, with keywords separated by commas.
zh_hans: 请直接输出改写后的检索字符串，各关键词以逗号分隔。
zh_hant: 請直接輸出改寫後的检索字符串，各關鍵词以逗號分隔。

# prompt.queryRewrite.rules
source: Requirements:
zh_hans: 要求：
zh_hant: 要求：

# prompt.queryRewrite.userQuery
source: User Original Query
zh_hans: 用户原始查询
zh_hant: 使用者原始查詢

# prompt.quiz.explanation
source: Explanation
zh_hans: 解析
zh_hant: 解析

# prompt.quiz.option
source: Option
zh_hans: 选项
zh_hant: 選項

# prompt.reset.factory
source: Restore to Defaults
zh_hans: 恢复为默认
zh_hant: 恢複為預設

# prompt.shortcut.deepReview
source: Deeply review my core concepts
zh_hans: 深度复盘我的核心概念
zh_hant: 深度複盤我的核心概念

# prompt.shortcut.findGaps
source: Find gaps in my knowledge system
zh_hans: 查找我知识体系中的断层
zh_hant: 查找我知識體係中的斷层

# prompt.shortcut.studyPath
source: Plan my next study path
zh_hans: 规划我的下一步学习路径
zh_hant: 規劃我的下一步學習路徑

# prompt.workshop.add
source: Add Shortcut
zh_hans: 新增指令
zh_hant: 新增指令

# prompt.workshop.input.placeholder
source: Enter shortcut…
zh_hans: 输入指令…
zh_hant: 輸入指令…

# prompt.workshop.intro.desc
source: Customize AI core logic, modify system prompts to control generation depth and style, and manage personal shortcuts.
zh_hans: 定制 AI 的核心处理逻辑，修改系统指令来掌控生成内容的深度与风格，管理个性化快捷指令。
zh_hant: 定制 AI 的核心處理逻辑，修改係統指令來掌控生成內容的深度与風格，管理個性化快捷指令。

# prompt.workshop.shortcuts.footer
source: These prompts will appear prioritized on the AI Assistant's welcome screen for quick one-tap sending.
zh_hans: 这些指令将优先出现在 AI 助手的欢迎界面，支持一键发送。
zh_hant: 這些指令將優先出現在 AI 助手的欢迎界面，支援一鍵發送。

# prompt.workshop.shortcuts.title
source: Pinned Shortcuts
zh_hans: 置顶指令
zh_hant: 置顶指令

# speech.audioLevel
source: Audio Level
zh_hans: 音频电平
zh_hant: 音頻电平

# speech.characters
source: characters
zh_hans: 字符
zh_hant: 字符

# speech.confirmAndEdit
source: Confirm and Edit
zh_hans: 确认并编辑
zh_hant: 確認並編輯

# speech.defaultTitle
source: Voice Note Preview
zh_hans: 语音笔记预览
zh_hant: 語音筆記預覽

# speech.error.audioEngine
source: Audio engine error
zh_hans: 音频引擎错误
zh_hant: 音頻引擎錯誤

# speech.error.localeNotSupported
source: Language not supported
zh_hans: 不支持该语言
zh_hant: 不支援该語言

# speech.error.notAuthorized
source: Not authorized
zh_hans: 未授权
zh_hant: 未授權

# speech.history
source: History
zh_hans: 历史记录
zh_hant: 历史記錄

# speech.lang.deDE
source: German
zh_hans: 德语
zh_hant: 德語

# speech.lang.enGB
source: English (UK)
zh_hans: 英语（英国）
zh_hant: 英語（英國）

# speech.lang.enUS
source: English (US)
zh_hans: 英语（美国）
zh_hant: 英語（美國）

# speech.lang.esES
source: Spanish
zh_hans: 西班牙语
zh_hant: 西班牙語

# speech.lang.frFR
source: French
zh_hans: 法语
zh_hant: 法語

# speech.lang.jaJP
source: Japanese
zh_hans: 日语
zh_hant: 日語

# speech.lang.koKR
source: Korean
zh_hans: 韩语
zh_hant: 韩語

# speech.lang.ptBR
source: Portuguese (BR)
zh_hans: 葡萄牙语（巴西）
zh_hant: 葡萄牙語（巴西）

# speech.lang.zhHans
source: Chinese (Simplified)
zh_hans: 中文（简体）
zh_hant: 中文（简體）

# speech.lang.zhHant
source: Chinese (Traditional)
zh_hans: 中文（繁体）
zh_hant: 中文（繁體）

# speech.language
source: Recognition Language
zh_hans: 识别语言
zh_hant: 識別語言

# speech.needPermission
source: Microphone permission required to record
zh_hans: 需要麦克风权限才能录音
zh_hant: 需要麥克風權限才能錄音

# speech.noteTitle
source: Note Title
zh_hans: 笔记标题
zh_hant: 筆記標題

# speech.noteTitlePlaceholder
source: Enter note title
zh_hans: 输入笔记标题
zh_hant: 輸入筆記標題

# speech.requestPermission
source: Request Permission
zh_hans: 请求权限
zh_hant: 請求權限

# speech.result
source: Transcription Result
zh_hans: 转录结果
zh_hant: 轉錄結果

# speech.saveTitle
source: Save Voice Note
zh_hans: 保存语音笔记
zh_hant: 儲存語音筆記

# speech.saveToKnowledge
source: Save to Knowledge
zh_hans: 保存到知识库
zh_hant: 儲存到知識庫

# speech.status.complete
source: Transcription complete
zh_hans: 转录完成
zh_hant: 轉錄完成

# speech.status.denied
source: Microphone access denied
zh_hans: 麦克风权限被拒绝
zh_hant: 麥克風權限被拒絕

# speech.status.error
source: Recognition error
zh_hans: 识别错误
zh_hant: 識別錯誤

# speech.status.notDetermined
source: Awaiting authorization
zh_hans: 等待授权
zh_hant: 等待授權

# speech.status.recording
source: Recording...
zh_hans: 正在录音...
zh_hant: 正在錄音...

# speech.status.restricted
source: Speech recognition restricted
zh_hans: 语音识别受限
zh_hant: 語音識別受限

# speech.status.simulatorNotSupported
source: Voice recording is not supported in Simulator. Please test on a real device.
zh_hans: 模拟器不支持语音录入，请在真机上测试
zh_hant: 模擬器不支援語音錄入，請在真機上测試

# speech.status.unknown
source: Unknown status
zh_hans: 未知状态
zh_hant: 未知狀態

# speech.subtitle
source: Speech to text — quickly capture ideas and knowledge
zh_hans: 语音转文字，快速记录灵感与知识
zh_hant: 語音轉文字，快速記錄靈感与知識

# synthesis.control.customPromptTitle
source: Custom Instruction
zh_hans: 定制提示词
zh_hant: 定制提示词

# speech.tapToRecord
source: Tap to start recording
zh_hans: 点击开始录音
zh_hant: 点擊開始錄音

# synthesis.control.describeType_%@
source: Describe the %@ you want to create
zh_hans: 描述您要创建的%@
zh_hant: 描述您要建立的%@

# synthesis.control.placeholder.expansion
source: Specify expansion dimension, e.g., 'Include multi-terminal sync evolution'.
zh_hans: 指定扩展维度或延伸领域，例如：“补充在分布式与多终端同步场景下的演变路径”
zh_hant: 指定擴展維度或延伸領域，例如：“補充在分布式与多終端同步場景下的演變路徑”

# synthesis.control.placeholder.infographic
source: Specify diagram style, e.g., 'Use blue theme and highlight 3 statistics'.
zh_hans: 指定风格、颜色或侧重点：“使用蓝色主题，并强调 3 个关键统计数据。”
zh_hant: 指定風格、顏色或侧重点：“使用藍色主題，並強調 3 個關鍵統计資料。”

# synthesis.control.placeholder.mindmap
source: Specify mindmap structure, e.g., '3 levels focusing on SQLite engine'.
zh_hans: 指定导图分支结构、层级重点或主题，例如：“以架构设计为核心，分为 3 层，并突出 SQLite 存储引擎”
zh_hant: 指定导圖分支結構、层级重点或主題，例如：“以架構設计為核心，分為 3 层，並突出 SQLite 存储引擎”

# synthesis.control.placeholder.quiz
source: Specify question types or difficulty, e.g., '5 multiple-choice questions on system layering'.
zh_hans: 指定题型、难度或测试重点，例如：“包含 5 道单选题，侧重考察系统架构分层设计”
zh_hant: 指定題型、难度或测試重点，例如：“包含 5 道單選題，侧重考察係統架構分层設计”

# synthesis.control.placeholder.report
source: Specify report focus area, e.g., 'Focus on risk control & cost analysis'.
zh_hans: 指定简报摘要侧重点，例如：“聚焦风险控制与成本分析，提供结论性执行摘要”
zh_hant: 指定简报摘要侧重点，例如：“聚焦風險控制与成本分析，提供結論性執行摘要”

# synthesis.control.placeholder.slides
source: Specify slide style or page count, e.g., '5 slides focusing on 3 core metrics'.
zh_hans: 指定幻灯片风格、页数或侧重点，例如：“生成 5 页 PPT，使用简约风，突出 3 项核心业务指标”
zh_hant: 指定幻灯片風格、頁數或侧重点，例如：“生成 5 頁 PPT，使用简約風，突出 3 項核心業務指標”

# speech.tapToStop
source: Tap to stop recording
zh_hans: 点击停止录音
zh_hant: 点擊停止錄音

# speech.title
source: Voice Note
zh_hans: 语音笔记
zh_hant: 語音筆記

# speech.voiceTag
source: voice
zh_hans: 语音
zh_hant: 語音

source: Synthesis Actions
zh_hans: 合成操作
zh_hant: 合成操作

# synthesis.batchDeleteConfirm
source: Delete selected synthesized documents
zh_hans: 删除选中的合成文档
zh_hant: 刪除選中的合成文档

# synthesis.clearAllConfirm
source: Clear all synthesized documents
zh_hans: 清空全部合成文档
zh_hant: 清空全部合成文档

# synthesis.documentList
source: Synthesis Documents
zh_hans: 已合成文档
zh_hant: 已合成文档

# synthesis.error.limitReached
source: Storage limit reached for this type
zh_hans: 已达到此类文档的存储上限
zh_hant: 已达到此類文档的存储上限

# synthesis.error.noPages
source: Vault is empty, cannot perform synthesis
zh_hans: 知识库为空，无法进行合成
zh_hant: 知識庫為空，無法進行合成

# synthesis.error.invalidResult
source: AI synthesis result is empty or invalid format
zh_hans: AI 合成生成失败，内容为空或格式无效
zh_hant: AI 合成生成失敗，內容為空或格式無效

# synthesis.error.pageNotFound
source: Associated source page not found
zh_hans: 未找到关联的源页面
zh_hant: 未找到關联的源頁面

# synthesis.fallback.coreConcept
source: Core Concept Analysis
zh_hans: 核心概念解析
zh_hant: 核心概念解析

# synthesis.fallback.reportOverview
source: ## 1. Overview and Core Objectives
zh_hans: ## 1. 概述与核心目标
zh_hant: ## 1. 概述与核心目標

# synthesis.fallback.reportKeyPoints
source: ## 2. Key Knowledge Analysis
zh_hans: ## 2. 关键知识要点分析
zh_hant: ## 2. 關鍵知識要点分析

# synthesis.fallback.reportPointItem
source: * **Key Point %lld**: %@
zh_hans: * **要点 %lld**: %@
zh_hant: * **要点 %lld**: %@

# synthesis.fallback.reportSummaryHeader
source: ## 3. Summary and Recommendations
zh_hans: ## 3. 总结与建议
zh_hant: ## 3. 總結与建議

# synthesis.fallback.reportSummaryBody
source: Based on synthesis of vault sources, the key points above provide structured background context.
zh_hans: 基于知识库相关来源的综合解析，以上核心要点提供了完整的结构化背景参考。
zh_hant: 基於知識庫相關來源的綜合解析，以上核心要点提供了完整的結構化背景参考。

# synthesis.fallback.expansionBackground
source: ## Background and Core Principles
zh_hans: ## 背景与科学原理
zh_hant: ## 背景与科學原理

# synthesis.fallback.expansionBackgroundBody
source: Based on vault materials, exploring core underlying logic and evolution.
zh_hans: 本主题立足于知识库现有资料，探讨其底层核心逻辑与发展脉络。
zh_hant: 本主題立足於知識庫現有資料，探讨其底层核心逻辑与發展脈絡。

# synthesis.fallback.expansionDetailsHeader
source: ## Deep Dive Details
zh_hans: ## 核心细节深度剖析
zh_hant: ## 核心細節深度剖析

# synthesis.fallback.expansionDetailItem
source: ### Detail Dimension %lld %@
zh_hans: ### 细节维度 %lld %@
zh_hant: ### 細節維度 %lld %@

# synthesis.fallback.expansionFutureBody
source: Exploring potential value in cross-domain applications and future evolution.
zh_hans: 探讨该知识主题在跨学科应用及未来演化中的潜在价值。
zh_hant: 探讨该知識主題在跨學科套用及未來演化中的潛在價值。

# synthesis.actions.polish
source: Polish
zh_hans: 润色
zh_hant: 潤色

# synthesis.actions.regenerate
source: Regenerate Section
zh_hans: 重新生成
zh_hant: 重新生成

# synthesis.control.audience
source: Target Audience
zh_hans: 目标受众
zh_hant: 目標受眾

# synthesis.control.audience.beginner
source: Beginner
zh_hans: 基础入门
zh_hant: 基础入門

# synthesis.control.audience.executive
source: Executive
zh_hans: 管理汇报
zh_hant: 管理汇报

# synthesis.control.audience.professional
source: Domain Expert
zh_hans: 领域专家
zh_hant: 領域專家

# synthesis.control.depth
source: Content Depth
zh_hans: 篇幅深度
zh_hant: 篇幅深度

# synthesis.control.depth.concise
source: Concise
zh_hans: 精简提炼
zh_hant: 精简提炼

# synthesis.control.depth.detailed
source: Detailed
zh_hans: 详尽长文
zh_hant: 詳盡長文

# synthesis.control.depth.standard
source: Standard
zh_hans: 标准深度
zh_hant: 標準深度

# synthesis.control.startSynthesis
source: Start AI Synthesis
zh_hans: 开始 AI 合成
zh_hant: 開始 AI 合成

# synthesis.control.title
source: Synthesis Control
zh_hans: 合成控制维度
zh_hant: 合成控制維度

# synthesis.control.tone
source: Tone & Style
zh_hans: 语气风格
zh_hant: 語氣風格

# synthesis.control.tone.academic
source: Academic Rigor
zh_hans: 学术严谨
zh_hant: 學術嚴谨

# synthesis.control.tone.casual
source: Casual
zh_hans: 生动风趣
zh_hant: 生動風趣

# synthesis.control.tone.professional
source: Professional Tone
zh_hans: 干练职场
zh_hant: 幹练職場

# prompt.expert.expansion.footer
source: Knowledge Expansion Footer
zh_hans: 知识扩写页脚
zh_hant: 知識擴寫頁腳

# prompt.expert.expansion.title
source: Knowledge Expansion
zh_hans: 知识扩写演进
zh_hant: 知識擴寫演進

# prompt.expert.infographic.footer
source: Infographic Footer
zh_hans: 信息图页脚
zh_hant: 資訊圖頁腳

# prompt.expert.infographic.title
source: Infographic Framework
zh_hans: 信息图框架
zh_hant: 資訊圖框架

# synthesis.fallback.slidesHeader
source: Key Takeaways
zh_hans: 核心要点
zh_hant: 核心要点

# synthesis.chatter.asRequested
source: as requested
zh_hans: 根据您的要求
zh_hant: 根據您的要求

# synthesis.chatter.belowAre
source: below are
zh_hans: 如下
zh_hant: 如下

# synthesis.chatter.belowIs
source: below is
zh_hans: 如下是
zh_hant: 如下是

# synthesis.chatter.followingIs
source: following is
zh_hans: 以下是
zh_hant: 以下是

# synthesis.chatter.hereAre
source: here are
zh_hans: 这里有
zh_hant: 這裏有

# synthesis.chatter.hereIs
source: here is
zh_hans: 这里是
zh_hant: 這裏是

# synthesis.chatter.heres
source: here's
zh_hans: 这有
zh_hant: 這有

# synthesis.chatter.parsedAs
source: parsed as
zh_hans: 解析如下
zh_hant: 解析如下

# synthesis.chatter.thisIs
source: this is
zh_hans: 这是
zh_hant: 這是

# synthesis.limitReachedWarning
source: Storage limit reached
zh_hans: 已达存储上限
zh_hant: 已达存储上限

# synthesis.mindmap.renderError
source: Failed to render mindmap. Please try regenerating.
zh_hans: 无法渲染思维导图，请重试生成。
zh_hant: 無法渲染思維导圖，請重試生成。

# synthesis.noDocs
source: No synthesis documents
zh_hans: 暂无此类合成文档
zh_hant: 暫無此類合成文档

# ai.accessibility.skeletonLabel
source: AI Deep Knowledge Synthesis in progress
zh_hans: AI 深度知识合成进行中
zh_hant: AI 深度知識合成進行中

# ai.accessibility.taskInProgress
source: Processing AI synthesis task
zh_hans: 正在处理 AI 合成任务
zh_hant: 正在處理 AI 合成任務

# ai.accessibility.taskFinishedAnnouncement
source: AI Task: %@ has been successfully generated
zh_hans: AI 任务：%@ 已成功生成完毕
zh_hant: AI 任務：%@ 已成功生成完毕

# ai.accessibility.taskFailedAnnouncement
source: AI Task: %@ failed to generate
zh_hans: AI 任务：%@ 生成失败
zh_hant: AI 任務：%@ 生成失敗

# ai.accessibility.progressValueFormat
source: Progress %lld percent, currently in stage: %@
zh_hans: 进度百分之%lld，当前处于：%@阶段
zh_hant: 進度百分之%lld，当前處於：%@阶段

# aitask.status.ready
source: Ready
zh_hans: 任务就绪
zh_hant: 任務就緒

source: AI Task
zh_hans: AI 任务
zh_hant: AI 任務

# prompt.replyInChinese
source: Please reply in English.
zh_hans: 请用中文回复。
zh_hant: 請用中文回複。

# prompt.summaryPrefix
source: Summarize the following content concisely.
zh_hans: 简洁地总结以下内容。
zh_hant: 简潔地總結以下內容。

# prompt.discoverLinksPrefix2
source: Based on the knowledge graph, identify hidden connections between these pages.
zh_hans: 基于知识图谱，识别这些页面之间的隐藏关联。
zh_hant: 基於知識圖譜，識別這些頁面之間的隱藏關联。

# prompt.reverseQAPrefix
source: Generate a question that this passage could answer.
zh_hans: 生成这段文本可以回答的问题。
zh_hant: 生成這段文本可以回答的問題。

# prompt.ingestDiscoveryAssistant
source: You are a knowledge discovery assistant. Analyze the ingested content and identify key topics, entities, and relationships.
zh_hans: 你是知识发现助手。分析摄入内容，识别关键主题、实体和关系。
zh_hant: 你是知識發現助手。分析攝入內容，識別關鍵主題、實體和關係。

# prompt.queryExpansion
source: Expand the following query into multiple search-friendly variations.
zh_hans: 将以下查询扩展为多个便于搜索的变体。
zh_hant: 將以下查詢擴展為多個便於搜尋的變體。

# prompt.discoverLinksPrefix1
source: Discover semantic links from the following content. Return a JSON array of linked page titles.
zh_hans: 从以下内容中发现语义关联，返回链接页面标题的 JSON 数组。
zh_hant: 从以下內容中發現語义關联，返回链接頁面標題的 JSON 數組。

# prompt.hydeUserPrompt
source: Generate a passage that answers:
zh_hans: 生成一段回答以下问题的文本：
zh_hant: 生成一段回答以下問題的文本：

# prompt.hydeSystem
source: You are a document generation assistant. Create a hypothetical document that would match the query.
zh_hans: 你是一个文档生成助手。请创建一段与查询匹配的假设性文档内容。
zh_hant: 你是一個文档生成助手。請建立一段与查詢匹配的假設性文档內容。

# prompt.rerankUserPrompt
source: Rank the following documents by relevance.
zh_hans: 按相关度排序以下文档。
zh_hant: 按相關度排序以下文档。

# prompt.rerankSystem
source: You are a relevance ranking assistant. Score each document's relevance to the query.
zh_hans: 你是相关度排序助手。对每篇文档与查询的相关度进行评分。
zh_hant: 你是相關度排序助手。對每篇文档与查詢的相關度進行評分。

# prompt.ingestManagementAssistant
source: You are a knowledge management assistant. Organize and structure the ingested knowledge.
zh_hans: 你是知识管理助手。组织和结构化摄入的知识内容。
zh_hant: 你是知識管理助手。組織和結構化攝入的知識內容。

# action.regenerate
source: Regenerate
zh_hans: 重新生成
zh_hant: 重新生成

# chat.messageCount
source: Message Count
zh_hans: 消息数
zh_hant: 消息數

# chat.contextLimitWarning
source: Context Limit Warning
zh_hans: 上下文长度预警
zh_hant: 上下文長度預警

# chat.referenceCount
source: Reference Count
zh_hans: 引用数
zh_hant: 引用數

# chat.activeSessionCount
source: Active Sessions
zh_hans: 活跃会话数
zh_hant: 活跃會話數

# chat.tokenUsage
source: Token Usage
zh_hans: Token 用量
zh_hant: Token 用量

# synthesis.citationInstruction
source: When synthesizing, cite source pages using [[Page Title]] format. Only state facts grounded in the provided content. Do not fabricate information not present in the sources.
zh_hans: 合成时请使用 [[页面标题]] 格式注明来源。仅陈述源材料中可验证的事实，禁止编造不存在的信息。
zh_hant: 合成時請使用 [[頁面標題]] 格式注明來源。仅陈述源材料中可驗證的事實，禁止编造不存在的資訊。

# synthesis.sourceCount_%d
source: %d sources
zh_hans: %d 个来源
zh_hant: %d 個來源

# llm.prompt.rule5
source: - Never fabricate facts, data, or names. If no evidence, say "Not found in knowledge base"
zh_hans: - 严禁编造事实、数据或人名。无依据时明确回答「知识库中未找到相关信息」，引用时使用 [[页面标题]] 注明出处
zh_hant: - 嚴禁编造事實、資料或人名。無依據時明確回答「知識庫中未找到相關資訊」，引用時使用 [[頁面標題]] 注明出處

# aitask.active
source: Active
zh_hans: 进行中
zh_hant: 進行中

# chat.title
source: AI Assistant
zh_hans: AI 对话
zh_hant: AI 對話

# aitask.type.ingest
source: Ingest
zh_hans: 知识导入
zh_hant: 知識匯入

# chat.ai.thinking
source: AI Thinking...
zh_hans: AI 正在思考...
zh_hant: AI 正在思考...

# aitask.clearAll
source: Clear All
zh_hans: 全部清除
zh_hant: 全部清除

# aitask.type.synthesis
source: Synthesis
zh_hans: 知识合成
zh_hant: 知識合成

# ondevice.status.ready
source: Ready
zh_hans: 就绪
zh_hant: 就緒

# speech.status.ready
source: Ready
zh_hans: 就绪
zh_hant: 就緒

# ai.status.thinking
source: AI is thinking...
zh_hans: AI 正在思考...
zh_hant: AI 正在思考...

# llm.model.preset
source: Preset Model
zh_hans: 选择预设模型
zh_hant: 選擇預設模型

# llm.model.custom
source: Custom Model ID
zh_hans: 自定义 Model ID
zh_hant: 自訂 Model ID

# llm.validation.emptyKey
source: API Key cannot be empty
zh_hans: API Key 不能为空
zh_hant: API Key 不能為空

# llm.validation.prefixHint
source: Prefix hint: Should start with "%@"
zh_hans: 前缀格式提醒：需以 "%@" 开头
zh_hant: 前缀格式提醒：需以 "%@" 開頭

# llm.validation.lengthHint
source: Length hint: At least %d characters
zh_hans: 长度提醒：长度通常不少于 %d 位
zh_hant: 長度提醒：長度通常不少於 %d 位

# synthesis.mindmap.defaultBranch1
source: Core Overview Analysis
zh_hans: 核心概要分析
zh_hant: 核心概要分析

# synthesis.mindmap.defaultBranch2
source: Key Insights Extraction
zh_hans: 知识要点提取
zh_hant: 知識要点提取

# prompt.system.summarize
source: You are a professional knowledge analyst. Analyze the provided content thoroughly and generate a structured summary.
zh_hans: 你是一个专业的知识分析师。请深入分析提供的文本并生成结构化的摘要。
zh_hant: 你是一個專業的知識分析師。請深入分析提供的文本並生成結構化的摘要。

# prompt.system.mindmap
source: You are a senior Knowledge Architect and Mind Map Expert. Analyze the input document thoroughly and construct a rich, multi-level hierarchical Mind Map in Mermaid format. Rules: 1. Always start with '# <Document Core Title>'. 2. Then output standard Mermaid code strictly starting with 'mindmap'. 3. Root node MUST be 'root((<Document Title>))'. 4. Extract 3 to 6 major themes as primary branches (indented by 4 spaces). 5. For each theme, extract 2 to 4 specific sub-points or key insights (indented by 6 spaces). 6. Do NOT use markdown code fences (```).
zh_hans: 你是一名资深知识架构师与思维导图专家。 请深入分析输入文档，并构建丰富、多层级的 Mermaid 格式思维导图。 规则： 1. 始终以 '# <文档核心标题>' 开头。 2. 然后输出严格以 'mindmap' 开头的标准 Mermaid 代码。 3. 根节点必须为 'root((<文档标题>))'。 4. 提取 3 至 6 个主要主题作为一级分支（缩进 4 个空格）。 5. 每个主题下提取 2 至 4 个具体子观点或核心洞察（缩进 6 个空格）。 6. 切勿使用 markdown 代码块包裹语法(```)。
zh_hant: 你是一名資深知識架構師与思維导圖專家。 請深入分析輸入文档，並構建豐富、多层级的 Mermaid 格式思維导圖。 規則： 1. 始終以 '# <文档核心標題>' 開頭。 2. 然後輸出嚴格以 'mindmap' 開頭的標準 Mermaid 程式碼。 3. 根節点必须為 'root((<文档標題>))'。 4. 提取 3 至 6 個主要主題作為一级分支（縮進 4 個空格）。 5. 每個主題下提取 2 至 4 個具體子觀点或核心洞察（縮進 6 個空格）。 6. 切勿使用 markdown 程式碼塊包裹語法(```)。

# prompt.system.actions
source: You are a task extraction expert. Identify and extract clear, actionable items and next steps from the content.
zh_hans: 你是一个任务提取专家。请从文本中识别并提取清晰、可执行的待办事项与下一步计划。
zh_hant: 你是一個任務提取專家。請从文本中識別並提取清晰、可執行的待办事項与下一步计劃。

# prompt.system.slides
source: You are a senior presentation designer and speech coach. Generate 5 to 8 structured Markdown slides based strictly on the provided content. Rules: 1. Always start with '# <Presentation Title>'. 2. Separate slides with '---' on a new line. Limit total slides strictly between 5 and 8 pages. 3. Each slide MUST begin with a clear section title ('## <Slide Title>') followed by 3 to 5 concise bullet points ('* <Point>'). 4. Do NOT output empty slides or title-only slides without bullet points.
zh_hans: 你是一名资深演示文稿设计师和演讲教练。 请严格基于所给内容生成 5 至 8 页结构化的 Markdown 幻灯片。 规则： 1. 始终以 '# <演示标题>' 开头。 2. 幻灯片之间用单独一行的 '---' 分隔。总页数严格控制在 5 至 8 页之间。 3. 每页幻灯片必须以清晰的小标题 ('## <页面标题>') 开头，后跟 3 至 5 条精炼的要点 ('* <要点>')。 4. 切勿输出空页面或只有标题无要点内容的页面。
zh_hant: 你是一名資深演示文稿設计師和演讲教练。 請嚴格基於所給內容生成 5 至 8 頁結構化的 Markdown 幻灯片。 規則： 1. 始終以 '# <演示標題>' 開頭。 2. 幻灯片之間用單独一行的 '---' 分隔。總頁數嚴格控制在 5 至 8 頁之間。 3. 每頁幻灯片必须以清晰的小標題 ('## <頁面標題>') 開頭，後跟 3 至 5 條精炼的要点 ('* <要点>')。 4. 切勿輸出空頁面或隻有標題無要点內容的頁面。
